#+TITLE: Link

#+NAME: dotfile-mappings
| source             | destination                               |
|--------------------+-------------------------------------------|
| ssh_config         | ~/.ssh/config                             |
| gitconfig          | ~/.gitconfig                              |
| gitignore          | ~/.gitignore                              |
| i3_config          | ~/.config/i3/config                       |
| pip.conf           | ~/.pip/pip.conf                           |
| kdewalletrc        | ~/.config/kdewalletrc                     |
| redshift.conf      | ~/.config/redshift.conf                   |
| flake8             | ~/.config/flake8                          |
| rustfmt.toml       | ~/.config/rustfmt/rustfmt.toml            |
| zshenv             | ~/.zshenv                                 |
| zshrc              | ~/.zshrc                                  |
| sbclrc             | ~/.sbclrc                                 |
| profile            | ~/.profile                                |
| fish/config.fish   | ~/.config/fish/config.fish                |
| mimeapps.list      | ~/.local/share/applications/mimeapps.list |
| zprofile           | ~/.zprofile                               |
| rofi_config        | ~/.config/rofi/config.rasi                |
| xfce_terminalrc    | ~/.config/xfce4/terminal/terminalrc       |
| mbsyncrc.conf      | ~/.mbsyncrc                               |
| tridactylrc        | ~/.config/tridactyl/tridactylrc           |
| notmuch.conf       | ~/.notmuch_config                         |
| i3status-rust.toml | ~/.config/i3status-rust/config.toml       |


#+NAME: systemd-mappings
| source                 | destination                                   |
|------------------------+-----------------------------------------------|
| gitwatch@.service      | ~/.config/systemd/user/gitwatch@.service      |
| backup-oneshot.service | ~/.config/systemd/user/backup-oneshot.service |
| backup.timer           | ~/.config/systemd/user/backup.timer           |
| gmail.timer            | ~/.config/systemd/user/gmail.timer            |
| fastmail.timer         | ~/.config/systemd/user/fastmail.timer         |
| checkmail@.service     | ~/.config/systemd/user/checkmail@.service     |
| emacs.service          | ~/.config/systemd/user/emacs.service          |

#+HEADER: :tangle link.py
#+HEADER: :var dotfiles=dotfile-mappings systemd=systemd-mappings
#+HEADER: :results output
#+begin_src python
from pathlib import Path
from typing import List

home = Path.home()
dotfiles_path = home / "dotfiles"

def firefox_settings():
    import configparser

    firefox_ini = str(home / ".mozilla" / "firefox" / "profiles.ini")

    profiles = configparser.ConfigParser()
    profiles.read(firefox_ini)

    firefox_profile_paths = []
    for k, v in profiles.items():
        if "Profile" in k:
            firefox_profile_paths.append(v.get("Path"))

    for profile_key, profile in profiles.items():
        if "Profile" in profile_key:
            firefox_profile = (
                home / ".mozilla" / "firefox" / profile.get("Path") / "chrome"
            )
            firefox_profile.mkdir(parents=True, exist_ok=True)

            source = dotfiles_path / "browser" / "userChrome.css"
            destination = firefox_profile / "userChrome.css"
            try:
                destination.symlink_to(source)
            except FileExistsError:
                pass

            print(f"firefox: {source} -> {destination}")


firefox_settings()

def link_files(directory: str, mappings: List[List[str]]):
    file_mappings = {
        (dotfiles_path / directory / row[0]): Path(row[1]).expanduser() for row in mappings
    }

    for source, destination in file_mappings.items():
        print(f"{directory}: {source} -> {destination}")
        try:
            try:
                destination.unlink()
            except:
                pass
            destination.parent.mkdir(parents=True, exist_ok=True)
            destination.symlink_to(source)
        except Exception as exc:
            print(exc)

link_files("systemd", systemd)
link_files("common", dotfiles)

for func in (dotfiles_path / "common/fish/functions").glob("*"):
    target = home / ".config/fish/functions" / func.name
    try:
        target.unlink()
    except:
        pass
    target.parent.mkdir(parents=True, exist_ok=True)
    target.symlink_to(func)
#+end_src

#+RESULTS:
#+begin_example
firefox: /home/lyterk/dotfiles/browser/userChrome.css -> /home/lyterk/.mozilla/firefox/s7jg6esa.default-esr/chrome/userChrome.css
firefox: /home/lyterk/dotfiles/browser/userChrome.css -> /home/lyterk/.mozilla/firefox/ek6o4fvz.default-release/chrome/userChrome.css
systemd: /home/lyterk/dotfiles/systemd/gitwatch@.service -> /home/lyterk/.config/systemd/user/gitwatch@.service
systemd: /home/lyterk/dotfiles/systemd/backup-oneshot.service -> /home/lyterk/.config/systemd/user/backup-oneshot.service
systemd: /home/lyterk/dotfiles/systemd/backup.timer -> /home/lyterk/.config/systemd/user/backup.timer
systemd: /home/lyterk/dotfiles/systemd/gmail.timer -> /home/lyterk/.config/systemd/user/gmail.timer
systemd: /home/lyterk/dotfiles/systemd/fastmail.timer -> /home/lyterk/.config/systemd/user/fastmail.timer
systemd: /home/lyterk/dotfiles/systemd/checkmail@.service -> /home/lyterk/.config/systemd/user/checkmail@.service
systemd: /home/lyterk/dotfiles/systemd/emacs.service -> /home/lyterk/.config/systemd/user/emacs.service
common: /home/lyterk/dotfiles/common/ssh_config -> /home/lyterk/.ssh/config
common: /home/lyterk/dotfiles/common/gitconfig -> /home/lyterk/.gitconfig
common: /home/lyterk/dotfiles/common/gitignore -> /home/lyterk/.gitignore
common: /home/lyterk/dotfiles/common/i3_config -> /home/lyterk/.config/i3/config
common: /home/lyterk/dotfiles/common/pip.conf -> /home/lyterk/.pip/pip.conf
common: /home/lyterk/dotfiles/common/kdewalletrc -> /home/lyterk/.config/kdewalletrc
common: /home/lyterk/dotfiles/common/redshift.conf -> /home/lyterk/.config/redshift.conf
common: /home/lyterk/dotfiles/common/flake8 -> /home/lyterk/.config/flake8
common: /home/lyterk/dotfiles/common/rustfmt.toml -> /home/lyterk/.config/rustfmt/rustfmt.toml
common: /home/lyterk/dotfiles/common/zshenv -> /home/lyterk/.zshenv
common: /home/lyterk/dotfiles/common/zshrc -> /home/lyterk/.zshrc
common: /home/lyterk/dotfiles/common/sbclrc -> /home/lyterk/.sbclrc
common: /home/lyterk/dotfiles/common/profile -> /home/lyterk/.profile
common: /home/lyterk/dotfiles/common/fish/config.fish -> /home/lyterk/.config/fish/config.fish
common: /home/lyterk/dotfiles/common/mimeapps.list -> /home/lyterk/.local/share/applications/mimeapps.list
common: /home/lyterk/dotfiles/common/zprofile -> /home/lyterk/.zprofile
common: /home/lyterk/dotfiles/common/rofi_config -> /home/lyterk/.config/rofi/config.rasi
common: /home/lyterk/dotfiles/common/xfce_terminalrc -> /home/lyterk/.config/xfce4/terminal/terminalrc
common: /home/lyterk/dotfiles/common/mbsyncrc.conf -> /home/lyterk/.mbsyncrc
common: /home/lyterk/dotfiles/common/tridactylrc -> /home/lyterk/.config/tridactyl/tridactylrc
common: /home/lyterk/dotfiles/common/notmuch.conf -> /home/lyterk/.notmuch_config
common: /home/lyterk/dotfiles/common/i3status-rust.toml -> /home/lyterk/.config/i3status-rust/config.toml
#+end_example
